### **Trabalho com planilhas de excel (08/10/2021)**

In [ ]:
#importar biblioteca pandas
import pandas as pd

In [ ]:
#ler arquivos xlsx.
# dessa vez temos muitas planilhas, então teremos um objeto (df) para cada arquivo.xlsx
df1 = pd.read_excel("/content/drive/MyDrive/Colab Notebooks/Datasets/Aracaju.xlsx")
df2 = pd.read_excel("/content/drive/MyDrive/Colab Notebooks/Datasets/Fortaleza.xlsx")
df3 = pd.read_excel("/content/drive/MyDrive/Colab Notebooks/Datasets/Natal.xlsx")
df4 = pd.read_excel("/content/drive/MyDrive/Colab Notebooks/Datasets/Recife.xlsx")
df5 = pd.read_excel("/content/drive/MyDrive/Colab Notebooks/Datasets/Salvador.xlsx")

In [ ]:
#juntar as planilhas em uma única. 
df = pd.concat([df1, df2, df3, df4, df5])
df.sample(5)

        Cidade       Data    Vendas  LojaID  Qtde
39    Salvador 2019-01-01  R$165,95    1036     3
115     Recife 2019-03-02   R$12,23     981     3
67       Natal 2019-02-14     R$379     852     2
90       Natal 2019-01-02  R$100,54    1036     2
18   Fortaleza 2019-01-01   R$38,31    1002     3

In [ ]:
#Perceba que a coluna "Vendas" está como str e contém "R$" e vírgula.
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas            object
LojaID             int64
Qtde               int64
dtype: object

In [ ]:
# Checar se há células vazias
# Não utilizei devido ao problema do tipo de variáveis
# df.isnull().sum()

In [ ]:
#Para retirá-los criamos uma função lambida que faz uso do método ".replace"
df["Vendas"] = df["Vendas"].apply(lambda x : x.replace("R$", ""))
df["Vendas"] = df["Vendas"].apply(lambda x : x.replace(",", "."))
#Depois disso, já é possível converter os dados da coluna em "float"
df["Vendas"] = df["Vendas"].astype("float")

In [ ]:
#Veja como ficou! :D
display(df)
df.dtypes

       Cidade       Data  Vendas  LojaID  Qtde
0     Aracaju 2018-01-01  142.00    1520     1
1     Aracaju 2018-01-01   14.21    1522     6
2     Aracaju 2018-01-01   71.55    1520     1
3     Aracaju 2018-01-01    3.01    1521     7
4     Aracaju 2018-01-01   24.51    1522     8
..        ...        ...     ...     ...   ...
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

[894 rows x 5 columns]

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [ ]:
#checar se há lojas sem vendas no período considerado
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [ ]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [ ]:
# Se eu tivesse campos vazios, poderia usar o campo .fillna para preencher os campos nulo da 
# coluna venda com a média dessa coluna, usando a função .mean()
df["Vendas"].fillna(df["Vendas"].mean(), inplace = True)
# Podemos atribuir qualquer valor para os campos em branco através da função .fillna. Veja o exemplo com "0":
df["Vendas"].fillna(0, inplace = True)

In [ ]:
# Verificando se ainda há valores nulos (célula vazia)
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [ ]:
df["Vendas"].mean()

122.62015659955237

In [ ]:
# Apagando linhas com valores nulos. Ou seja, de qualquer coluna
df.dropna(inplace= True)

In [ ]:
# Apagar linhas da coluna vendas com valor nulo (Null)
#Nulo (Null) é diferente de um missing value (NA)
df.dropna(subset = ["Vendas"], inplace = True)

In [ ]:
# Apagar apenas linhas como TODOS os campos nulos (em branco)
df.dropna(how='all', inplace=True)

####### **Criando Colunas**

In [ ]:
# Criar uma coluna com valores iguais a zero (improvisei rsrs)
df["Receita"] = df["Vendas"] - df["Vendas"]
display(df)

       Cidade       Data  Vendas  LojaID  Qtde  Receita
0     Aracaju 2018-01-01  142.00    1520     1      0.0
1     Aracaju 2018-01-01   14.21    1522     6      0.0
2     Aracaju 2018-01-01   71.55    1520     1      0.0
3     Aracaju 2018-01-01    3.01    1521     7      0.0
4     Aracaju 2018-01-01   24.51    1522     8      0.0
..        ...        ...     ...     ...   ...      ...
235  Salvador 2019-01-03   41.84    1034     1      0.0
236  Salvador 2019-01-03  126.29    1035     3      0.0
237  Salvador 2019-01-03   38.06    1036     3      0.0
238  Salvador 2019-01-03  139.64    1035     1      0.0
239  Salvador 2019-01-03  161.41    1037     3      0.0

[894 rows x 6 columns]

In [ ]:
#Criar a coluna Receita, sendo Receita = Vendas * Qtde
#Poderia ser df["Receita"] = df["Vendas"]*df["Qtde"], mas usaremos:
df["Receita"] = df["Vendas"].mul(df["Qtde"])
df.head()

    Cidade       Data  Vendas  LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00    1520     1   142.00
1  Aracaju 2018-01-01   14.21    1522     6    85.26
2  Aracaju 2018-01-01   71.55    1520     1    71.55
3  Aracaju 2018-01-01    3.01    1521     7    21.07
4  Aracaju 2018-01-01   24.51    1522     8   196.08

In [ ]:
df["Vendas"].max()

886.0

In [ ]:
df["Vendas"].min()

In [ ]:
df.nlargest(3, "Receita")

   Cidade       Data  Vendas  LojaID  Qtde  Receita
7   Natal 2019-03-18   886.0     853     4   3544.0
51  Natal 2018-01-21   859.0     852     4   3436.0
55  Natal 2019-01-08   859.0     854     4   3436.0

In [ ]:
df.nsmallest(3, "Receita")

        Cidade       Data  Vendas  LojaID  Qtde  Receita
19   Fortaleza 2019-01-01    0.00    1002     3     0.00
118    Aracaju 2018-01-01    3.34    1522     1     3.34
65      Recife 2019-01-01    4.01     981     1     4.01

In [ ]:
df.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     38015.37
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [ ]:
# ORDENAR PELOS VALORES DE UMA DETERMINADA COLUNA 
df.sort_values("Receita", ascending= False)

NameError: ignored